# St7GetNLAResetAtIncrement

Returns the RESET MODEL flag for the specified increment in the nonlinear static analysis load table.

Strand7 API Manual

long St7GetNLAResetAtIncrement(long uID, long Increment, bool* Reset)

Input Parameters

uID

Strand7 model file ID.

Increment

Increment number.

Output Parameters

Reset

True to reset the model.